pbuchabqui/OpenEMS_H5/src/hal/startup_stm32h562.s
/* ── Default_Handler ─────────────────────────────────────────────────────── */
/* Todas as ISRs não implementadas caem aqui. Loop infinito permite que o IWDG */
/* (100 ms) resete o sistema — mais seguro do que retornar de uma ISR inesperada. */

    .section .text.Default_Handler, "ax", %progbits

Default_Handler:
    b     Default_Handler

    .size  Default_Handler, .-Default_Handler

/* ── Weak aliases ─────────────────────────────────────────────────────────── */
/* Handlers marcados como .weak podem ser sobrescritos por implementações em   */
/* arquivos .cpp/.c sem precisar modificar este arquivo de startup.            */

    /* ARM core exceptions */
    .weak  NMI_Handler
    .thumb_set NMI_Handler, Default_Handler

    .weak  HardFault_Handler
    .thumb_set HardFault_Handler, Default_Handler

    .weak  MemManage_Handler
    .thumb_set MemManage_Handler, Default_Handler

    .weak  BusFault_Handler
    .thumb_set BusFault_Handler, Default_Handler

    .weak  UsageFault_Handler
    .thumb_set UsageFault_Handler, Default_Handler

    .weak  SecureFault_Handler
    .thumb_set SecureFault_Handler, Default_Handler

    .weak  SVC_Handler
    .thumb_set SVC_Handler, Default_Handler

    .weak  DebugMon_Handler
    .thumb_set DebugMon_Handler, Default_Handler

    .weak  PendSV_Handler
    .thumb_set PendSV_Handler, Default_Handler

    /* SysTick_Handler: implementado em system.cpp — NÃO weak aqui */
    /* para garantir que o linker use a implementação real             */
    .weak  SysTick_Handler
    .thumb_set SysTick_Handler, Default_Handler

    /* STM32H562 IRQ handlers usados pelo firmware */
    .weak  ADC1_2_IRQHandler
    .thumb_set ADC1_2_IRQHandler, Default_Handler

    .weak  TIM1_CC_IRQHandler
    .thumb_set TIM1_CC_IRQHandler, Default_Handler

    .weak  TIM5_IRQHandler
    .thumb_set TIM5_IRQHandler, Default_Handler

    .weak  USART3_IRQHandler
    .thumb_set USART3_IRQHandler, Default_Handler

    .weak  FDCAN1_IT0_IRQHandler
    .thumb_set FDCAN1_IT0_IRQHandler, Default_Handler

    .weak  FDCAN1_IT1_IRQHandler
    .thumb_set FDCAN1_IT1_IRQHandler, Default_Handler

    /* Handlers restantes (não usados pelo firmware, mas necessários na tabela) */
    .weak  WWDG_IRQHandler
    .thumb_set WWDG_IRQHandler, Default_Handler
    .weak  PVD_AVD_IRQHandler
    .thumb_set PVD_AVD_IRQHandler, Default_Handler
    .weak  RTC_IRQHandler
    .thumb_set RTC_IRQHandler, Default_Handler
    .weak  RTC_S_IRQHandler
    .thumb_set RTC_S_IRQHandler, Default_Handler
    .weak  TAMP_IRQHandler
    .thumb_set TAMP_IRQHandler, Default_Handler
    .weak  RAMCFG_IRQHandler
    .thumb_set RAMCFG_IRQHandler, Default_Handler
    .weak  FLASH_IRQHandler
    .thumb_set FLASH_IRQHandler, Default_Handler
    .weak  FLASH_S_IRQHandler
    .thumb_set FLASH_S_IRQHandler, Default_Handler
    .weak  GTZC_IRQHandler
    .thumb_set GTZC_IRQHandler, Default_Handler
    .weak  RCC_IRQHandler
    .thumb_set RCC_IRQHandler, Default_Handler
    .weak  RCC_S_IRQHandler
    .thumb_set RCC_S_IRQHandler, Default_Handler
    .weak  EXTI0_IRQHandler
    .thumb_set EXTI0_IRQHandler, Default_Handler
    .weak  EXTI1_IRQHandler
    .thumb_set EXTI1_IRQHandler, Default_Handler
    .weak  EXTI2_IRQHandler
    .thumb_set EXTI2_IRQHandler, Default_Handler
    .weak  EXTI3_IRQHandler
    .thumb_set EXTI3_IRQHandler, Default_Handler
    .weak  EXTI4_IRQHandler
    .thumb_set EXTI4_IRQHandler, Default_Handler
    .weak  EXTI5_IRQHandler
    .thumb_set EXTI5_IRQHandler, Default_Handler
    .weak  EXTI6_IRQHandler
    .thumb_set EXTI6_IRQHandler, Default_Handler
    .weak  EXTI7_IRQHandler
    .thumb_set EXTI7_IRQHandler, Default_Handler
    .weak  EXTI8_IRQHandler
    .thumb_set EXTI8_IRQHandler, Default_Handler
    .weak  EXTI9_IRQHandler
    .thumb_set EXTI9_IRQHandler, Default_Handler
    .weak  EXTI10_IRQHandler
    .thumb_set EXTI10_IRQHandler, Default_Handler
    .weak  EXTI11_IRQHandler
    .thumb_set EXTI11_IRQHandler, Default_Handler
    .weak  EXTI12_IRQHandler
    .thumb_set EXTI12_IRQHandler, Default_Handler
    .weak  EXTI13_IRQHandler
    .thumb_set EXTI13_IRQHandler, Default_Handler
    .weak  EXTI14_IRQHandler
    .thumb_set EXTI14_IRQHandler, Default_Handler
    .weak  EXTI15_IRQHandler
    .thumb_set EXTI15_IRQHandler, Default_Handler
    .weak  GPDMA1_Channel0_IRQHandler
    .thumb_set GPDMA1_Channel0_IRQHandler, Default_Handler
    .weak  GPDMA1_Channel1_IRQHandler
    .thumb_set GPDMA1_Channel1_IRQHandler, Default_Handler
    .weak  GPDMA1_Channel2_IRQHandler
    .thumb_set GPDMA1_Channel2_IRQHandler, Default_Handler
    .weak  GPDMA1_Channel3_IRQHandler
    .thumb_set GPDMA1_Channel3_IRQHandler, Default_Handler
    .weak  GPDMA1_Channel4_IRQHandler
    .thumb_set GPDMA1_Channel4_IRQHandler, Default_Handler
    .weak  GPDMA1_Channel5_IRQHandler
    .thumb_set GPDMA1_Channel5_IRQHandler, Default_Handler
    .weak  GPDMA1_Channel6_IRQHandler
    .thumb_set GPDMA1_Channel6_IRQHandler, Default_Handler
    .weak  GPDMA1_Channel7_IRQHandler
    .thumb_set GPDMA1_Channel7_IRQHandler, Default_Handler
    .weak  IWDG_IRQHandler
    .thumb_set IWDG_IRQHandler, Default_Handler
    .weak  SAES_IRQHandler
    .thumb_set SAES_IRQHandler, Default_Handler
    .weak  DAC1_IRQHandler
    .thumb_set DAC1_IRQHandler, Default_Handler
    .weak  FDCAN2_IT0_IRQHandler
    .thumb_set FDCAN2_IT0_IRQHandler, Default_Handler
    .weak  FDCAN2_IT1_IRQHandler
    .thumb_set FDCAN2_IT1_IRQHandler, Default_Handler
    .weak  TIM1_BRK_IRQHandler
    .thumb_set TIM1_BRK_IRQHandler, Default_Handler
    .weak  TIM1_TRG_COM_IRQHandler
    .thumb_set TIM1_TRG_COM_IRQHandler, Default_Handler
    .weak  TIM1_UP_IRQHandler
    .thumb_set TIM1_UP_IRQHandler, Default_Handler
    .weak  TIM2_IRQHandler
    .thumb_set TIM2_IRQHandler, Default_Handler
    .weak  TIM6_IRQHandler
    .thumb_set TIM6_IRQHandler, Default_Handler
    .weak  TIM7_IRQHandler
    .thumb_set TIM7_IRQHandler, Default_Handler
    .weak  I2C1_EV_IRQHandler
    .thumb_set I2C1_EV_IRQHandler, Default_Handler
    .weak  I2C1_ER_IRQHandler
    .thumb_set I2C1_ER_IRQHandler, Default_Handler
    .weak  I2C2_EV_IRQHandler
    .thumb_set I2C2_EV_IRQHandler, Default_Handler
    .weak  I2C2_ER_IRQHandler
    .thumb_set I2C2_ER_IRQHandler, Default_Handler
    .weak  SPI1_IRQHandler
    .thumb_set SPI1_IRQHandler, Default_Handler
    .weak  SPI2_IRQHandler
    .thumb_set SPI2_IRQHandler, Default_Handler
    .weak  SPI3_IRQHandler
    .thumb_set SPI3_IRQHandler, Default_Handler
    .weak  USART1_IRQHandler
    .thumb_set USART1_IRQHandler, Default_Handler
    .weak  USART2_IRQHandler
    .thumb_set USART2_IRQHandler, Default_Handler
    .weak  UART4_IRQHandler
    .thumb_set UART4_IRQHandler, Default_Handler
    .weak  UART5_IRQHandler
    .thumb_set UART5_IRQHandler, Default_Handler
    .weak  UART7_IRQHandler
    .thumb_set UART7_IRQHandler, Default_Handler
    .weak  UART8_IRQHandler
    .thumb_set UART8_IRQHandler, Default_Handler
    .weak  I2C3_EV_IRQHandler
    .thumb_set I2C3_EV_IRQHandler, Default_Handler
    .weak  I2C3_ER_IRQHandler
    .thumb_set I2C3_ER_IRQHandler, Default_Handler
    .weak  OTG_FS_IRQHandler
    .thumb_set OTG_FS_IRQHandler, Default_Handler
    .weak  ETH_IRQHandler
    .thumb_set ETH_IRQHandler, Default_Handler
    .weak  CORDIC_IRQHandler
    .thumb_set CORDIC_IRQHandler, Default_Handler
    .weak  UART9_IRQHandler
    .thumb_set UART9_IRQHandler, Default_Handler
    .weak  USART6_IRQHandler
    .thumb_set USART6_IRQHandler, Default_Handler
    .weak  USART10_IRQHandler
    .thumb_set USART10_IRQHandler, Default_Handler
    .weak  USART11_IRQHandler
    .thumb_set USART11_IRQHandler, Default_Handler
    .weak  UART12_IRQHandler
    .thumb_set UART12_IRQHandler, Default_Handler
    .weak  I3C1_EV_IRQHandler
    .thumb_set I3C1_EV_IRQHandler, Default_Handler
    .weak  I3C1_ER_IRQHandler
    .thumb_set I3C1_ER_IRQHandler, Default_Handler
    .weak  DTS_IRQHandler
    .thumb_set DTS_IRQHandler, Default_Handler
    .weak  MCE1_IRQHandler
    .thumb_set MCE1_IRQHandler, Default_Handler
    .weak  MCE2_IRQHandler
    .thumb_set MCE2_IRQHandler, Default_Handler
    .weak  MCE3_IRQHandler
    .thumb_set MCE3_IRQHandler, Default_Handler
    .weak  LPTIM1_IRQHandler
    .thumb_set LPTIM1_IRQHandler, Default_Handler
    .weak  LPTIM2_IRQHandler
    .thumb_set LPTIM2_IRQHandler, Default_Handler
    .weak  LPTIM3_IRQHandler
    .thumb_set LPTIM3_IRQHandler, Default_Handler
    .weak  LPTIM4_IRQHandler
    .thumb_set LPTIM4_IRQHandler, Default_Handler
    .weak  LPTIM5_IRQHandler
    .thumb_set LPTIM5_IRQHandler, Default_Handler
    .weak  LPTIM6_IRQHandler
    .thumb_set LPTIM6_IRQHandler, Default_Handler
    .weak  VREFBUF_IRQHandler
    .thumb_set VREFBUF_IRQHandler, Default_Handler
    .weak  I2C4_EV_IRQHandler
    .thumb_set I2C4_EV_IRQHandler, Default_Handler
    .weak  I2C4_ER_IRQHandler
    .thumb_set I2C4_ER_IRQHandler, Default_Handler
    .weak  SPI4_IRQHandler
    .thumb_set SPI4_IRQHandler, Default_Handler
    .weak  SPI5_IRQHandler
    .thumb_set SPI5_IRQHandler, Default_Handler
    .weak  SPI6_IRQHandler
    .thumb_set SPI6_IRQHandler, Default_Handler
    .weak  SAI1_IRQHandler
    .thumb_set SAI1_IRQHandler, Default_Handler
    .weak  SAI2_IRQHandler
    .thumb_set SAI2_IRQHandler, Default_Handler
    .weak  TIM3_IRQHandler
    .thumb_set TIM3_IRQHandler, Default_Handler
    .weak  TIM4_IRQHandler
    .thumb_set TIM4_IRQHandler, Default_Handler
    .weak  TIM8_BRK_IRQHandler
    .thumb_set TIM8_BRK_IRQHandler, Default_Handler
    .weak  TIM8_UP_IRQHandler
    .thumb_set TIM8_UP_IRQHandler, Default_Handler
    .weak  TIM8_TRG_COM_IRQHandler
    .thumb_set TIM8_TRG_COM_IRQHandler, Default_Handler
    .weak  TIM8_CC_IRQHandler
    .thumb_set TIM8_CC_IRQHandler, Default_Handler
    .weak  TIM15_IRQHandler
    .thumb_set TIM15_IRQHandler, Default_Handler
    .weak  TIM16_IRQHandler
    .thumb_set TIM16_IRQHandler, Default_Handler
    .weak  TIM17_IRQHandler
    .thumb_set TIM17_IRQHandler, Default_Handler
    .weak  HASH_IRQHandler
    .thumb_set HASH_IRQHandler, Default_Handler
    .weak  CRYP_IRQHandler
    .thumb_set CRYP_IRQHandler, Default_Handler
    .weak  PKA_IRQHandler
    .thumb_set PKA_IRQHandler, Default_Handler
